public class Static {
    /*
    Модификатор Static указывает на привязку объекта к текущему классу.
    Применяется к полям, блокам, методам, классам.
    Статическое поле:
    если переменная не статическая, то у каждого объекта будет своё значение переменной
    если статическая, то для всех объектов переменная одинакова (по последнему назначению).
    Нужно, если например нам нужно создать общую для всех объектов переменную и у каждого объекта должен быть доступ, чтобы изменять переменную.
    Статический метод:
    - Принадлежит классу, а не объекту
    - может обратиться только к статическим переменным.

     */
}
